AndEmi81/indesit_inertia_rx210/HAL/RN_RX200/RN_RX200_reg.h
/***********************************************************************/
/*  													               */
/*      PROJECT NAME :  PortindesitBoot                                */
/*      FILE         :  iodefine.h                                     */
/*      DESCRIPTION  :  Definition of I/O Registers                    */
/*      CPU SERIES   :  RX200                                          */
/*      CPU TYPE     :  RX210                                          */
/*  													               */
/*      This file is generated by e2studio.                        */
/*  													               */
/***********************************************************************/




#ifndef __RX210IODEFINE_HEADER__
#define __RX210IODEFINE_HEADER__

#ifdef __RX_LITTLE_ENDIAN__		/*Little endian*/
struct st_bsc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char STSCLR:1;
            unsigned char :7;
        } BIT;
    } BERCLR;
    char           wk0[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IGAEN:1;
            unsigned char TOEN:1;
            unsigned char :6;
        } BIT;
    } BEREN;
    char           wk1[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IA:1;
            unsigned char TO:1;
            unsigned char :2;
            unsigned char MST:3;
            unsigned char :1;
        } BIT;
    } BERSR1;
    char           wk2[1];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :3;
            unsigned short ADDR:13;
        } BIT;
    } BERSR2;
    char           wk3[4];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short BPRA:2;
            unsigned short BPRO:2;
            unsigned short BPIB:2;
            unsigned short BPGB:2;
            unsigned short :2;
            unsigned short BPFB:2;
            unsigned short BPEB:2;
            unsigned short :2;
        } BIT;
    } BUSPRI;
    char           wk4[7408];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short WRMOD:1;
            unsigned short :2;
            unsigned short EWENB:1;
            unsigned short :4;
            unsigned short PRENB:1;
            unsigned short PWENB:1;
            unsigned short :5;
            unsigned short PRMOD:1;
        } BIT;
    } CS0MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CSPWWAIT:3;
            unsigned long :5;
            unsigned long CSPRWAIT:3;
            unsigned long :5;
            unsigned long CSWWAIT:5;
            unsigned long :3;
            unsigned long CSRWAIT:5;
            unsigned long :3;
        } BIT;
    } CS0WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CSROFF:3;
            unsigned long :1;
            unsigned long CSWOFF:3;
            unsigned long :1;
            unsigned long WDOFF:3;
            unsigned long :1;
            unsigned long AWAIT:2;
            unsigned long :2;
            unsigned long RDON:3;
            unsigned long :1;
            unsigned long WRON:3;
            unsigned long :1;
            unsigned long WDON:3;
            unsigned long :1;
            unsigned long CSON:3;
            unsigned long :1;
        } BIT;
    } CS0WCR2;
    char           wk5[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short WRMOD:1;
            unsigned short :2;
            unsigned short EWENB:1;
            unsigned short :4;
            unsigned short PRENB:1;
            unsigned short PWENB:1;
            unsigned short :5;
            unsigned short PRMOD:1;
        } BIT;
    } CS1MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CSPWWAIT:3;
            unsigned long :5;
            unsigned long CSPRWAIT:3;
            unsigned long :5;
            unsigned long CSWWAIT:5;
            unsigned long :3;
            unsigned long CSRWAIT:5;
            unsigned long :3;
        } BIT;
    } CS1WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CSROFF:3;
            unsigned long :1;
            unsigned long CSWOFF:3;
            unsigned long :1;
            unsigned long WDOFF:3;
            unsigned long :1;
            unsigned long AWAIT:2;
            unsigned long :2;
            unsigned long RDON:3;
            unsigned long :1;
            unsigned long WRON:3;
            unsigned long :1;
            unsigned long WDON:3;
            unsigned long :1;
            unsigned long CSON:3;
            unsigned long :1;
        } BIT;
    } CS1WCR2;
    char           wk6[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short WRMOD:1;
            unsigned short :2;
            unsigned short EWENB:1;
            unsigned short :4;
            unsigned short PRENB:1;
            unsigned short PWENB:1;
            unsigned short :5;
            unsigned short PRMOD:1;
        } BIT;
    } CS2MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CSPWWAIT:3;
            unsigned long :5;
            unsigned long CSPRWAIT:3;
            unsigned long :5;
            unsigned long CSWWAIT:5;
            unsigned long :3;
            unsigned long CSRWAIT:5;
            unsigned long :3;
        } BIT;
    } CS2WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CSROFF:3;
            unsigned long :1;
            unsigned long CSWOFF:3;
            unsigned long :1;
            unsigned long WDOFF:3;
            unsigned long :1;
            unsigned long AWAIT:2;
            unsigned long :2;
            unsigned long RDON:3;
            unsigned long :1;
            unsigned long WRON:3;
            unsigned long :1;
            unsigned long WDON:3;
            unsigned long :1;
            unsigned long CSON:3;
            unsigned long :1;
        } BIT;
    } CS2WCR2;
    char           wk7[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short WRMOD:1;
            unsigned short :2;
            unsigned short EWENB:1;
            unsigned short :4;
            unsigned short PRENB:1;
            unsigned short PWENB:1;
            unsigned short :5;
            unsigned short PRMOD:1;
        } BIT;
    } CS3MOD;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CSPWWAIT:3;
            unsigned long :5;
            unsigned long CSPRWAIT:3;
            unsigned long :5;
            unsigned long CSWWAIT:5;
            unsigned long :3;
            unsigned long CSRWAIT:5;
            unsigned long :3;
        } BIT;
    } CS3WCR1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long CSROFF:3;
            unsigned long :1;
            unsigned long CSWOFF:3;
            unsigned long :1;
            unsigned long WDOFF:3;
            unsigned long :1;
            unsigned long AWAIT:2;
            unsigned long :2;
            unsigned long RDON:3;
            unsigned long :1;
            unsigned long WRON:3;
            unsigned long :1;
            unsigned long WDON:3;
            unsigned long :1;
            unsigned long CSON:3;
            unsigned long :1;
        } BIT;
    } CS3WCR2;
    char           wk8[1990];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short EXENB:1;
            unsigned short :3;
            unsigned short BSIZE:2;
            unsigned short :2;
            unsigned short EMODE:1;
            unsigned short :3;
            unsigned short MPXEN:1;
            unsigned short :3;
        } BIT;
    } CS0CR;
    char           wk9[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short RRCV:4;
            unsigned short :4;
            unsigned short WRCV:4;
            unsigned short :4;
        } BIT;
    } CS0REC;
    char           wk10[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short EXENB:1;
            unsigned short :3;
            unsigned short BSIZE:2;
            unsigned short :2;
            unsigned short EMODE:1;
            unsigned short :3;
            unsigned short MPXEN:1;
            unsigned short :3;
        } BIT;
    } CS1CR;
    char           wk11[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short RRCV:4;
            unsigned short :4;
            unsigned short WRCV:4;
            unsigned short :4;
        } BIT;
    } CS1REC;
    char           wk12[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short EXENB:1;
            unsigned short :3;
            unsigned short BSIZE:2;
            unsigned short :2;
            unsigned short EMODE:1;
            unsigned short :3;
            unsigned short MPXEN:1;
            unsigned short :3;
        } BIT;
    } CS2CR;
    char           wk13[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short RRCV:4;
            unsigned short :4;
            unsigned short WRCV:4;
            unsigned short :4;
        } BIT;
    } CS2REC;
    char           wk14[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short EXENB:1;
            unsigned short :3;
            unsigned short BSIZE:2;
            unsigned short :2;
            unsigned short EMODE:1;
            unsigned short :3;
            unsigned short MPXEN:1;
            unsigned short :3;
        } BIT;
    } CS3CR;
    char           wk15[6];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short RRCV:4;
            unsigned short :4;
            unsigned short WRCV:4;
            unsigned short :4;
        } BIT;
    } CS3REC;
    char           wk16[68];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short RCVEN0:1;
            unsigned short RCVEN1:1;
            unsigned short RCVEN2:1;
            unsigned short RCVEN3:1;
            unsigned short RCVEN4:1;
            unsigned short RCVEN5:1;
            unsigned short RCVEN6:1;
            unsigned short RCVEN7:1;
            unsigned short RCVENM0:1;
            unsigned short RCVENM1:1;
            unsigned short RCVENM2:1;
            unsigned short RCVENM3:1;
            unsigned short RCVENM4:1;
            unsigned short RCVENM5:1;
            unsigned short RCVENM6:1;
            unsigned short RCVENM7:1;
        } BIT;
    } CSRECEN;
};

struct st_cac
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CFME:1;
            unsigned char :7;
        } BIT;
    } CACR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CACREFE:1;
            unsigned char FMCS:3;
            unsigned char TCSS:2;
            unsigned char EDGES:2;
        } BIT;
    } CACR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RPS:1;
            unsigned char RSCS:3;
            unsigned char RCDS:2;
            unsigned char DFS:2;
        } BIT;
    } CACR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char FERRIE:1;
            unsigned char MENDIE:1;
            unsigned char OVFIE:1;
            unsigned char :1;
            unsigned char FERRFCL:1;
            unsigned char MENDFCL:1;
            unsigned char OVFFCL:1;
            unsigned char :1;
        } BIT;
    } CAICR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char FERRF:1;
            unsigned char MENDF:1;
            unsigned char OVFF:1;
            unsigned char :5;
        } BIT;
    } CASTR;
    char           wk0[1];
    unsigned short CAULVR;
    unsigned short CALLVR;
    unsigned short CACNTBR;
};

struct st_cmpb
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CPB0INI:1;
            unsigned char :3;
            unsigned char CPB1INI:1;
            unsigned char :3;
        } BIT;
    } CPBCNT1;
    char           wk0[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char CPB0OUT:1;
            unsigned char :3;
            unsigned char CPB1OUT:1;
        } BIT;
    } CPBFLG;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CPB0INTEN:1;
            unsigned char CPB0INTEG:1;
            unsigned char CPB0INTPL:1;
            unsigned char :1;
            unsigned char CPB1INTEN:1;
            unsigned char CPB1INTEG:1;
            unsigned char CPB1INTPL:1;
            unsigned char :1;
        } BIT;
    } CPBINT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CPB0FEN:1;
            unsigned char :1;
            unsigned char CPB0F:2;
            unsigned char CPB1FEN:1;
            unsigned char :1;
            unsigned char CPB1F:2;
        } BIT;
    } CPBF;
};

