AndEmi81/indesit_inertia_rx210/HAL/RN_RX200/RN_RX200_reg.h
struct st_cmt
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short STR0:1;
            unsigned short STR1:1;
            unsigned short :14;
        } BIT;
    } CMSTR0;
    char           wk0[14];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short STR2:1;
            unsigned short STR3:1;
            unsigned short :14;
        } BIT;
    } CMSTR1;
};

struct st_cmt0
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CKS:2;
            unsigned short :4;
            unsigned short CMIE:1;
            unsigned short :9;
        } BIT;
    } CMCR;
    unsigned short CMCNT;
    unsigned short CMCOR;
};

struct st_crc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char GPS:2;
            unsigned char LMS:1;
            unsigned char :4;
            unsigned char DORCLR:1;
        } BIT;
    } CRCCR;
    unsigned char  CRCDIR;
    unsigned short CRCDOR;
};

struct st_da
{
    unsigned short DADR0;
    unsigned short DADR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char DAE:1;
            unsigned char DAOE0:1;
            unsigned char DAOE1:1;
        } BIT;
    } DACR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char DPSEL:1;
        } BIT;
    } DADPR;
};

struct st_dmac
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DMST:1;
            unsigned char :7;
        } BIT;
    } DMAST;
};

struct st_dmac0
{
    unsigned long  DMSAR;
    unsigned long  DMDAR;
    unsigned long  DMCRA;
    unsigned short DMCRB;
    char           wk0[2];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short DCTG:2;
            unsigned short :6;
            unsigned short SZ:2;
            unsigned short :2;
            unsigned short DTS:2;
            unsigned short MD:2;
        } BIT;
    } DMTMD;
    char           wk1[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DARIE:1;
            unsigned char SARIE:1;
            unsigned char RPTIE:1;
            unsigned char ESIE:1;
            unsigned char DTIE:1;
            unsigned char :3;
        } BIT;
    } DMINT;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short DARA:5;
            unsigned short :1;
            unsigned short DM:2;
            unsigned short SARA:5;
            unsigned short :1;
            unsigned short SM:2;
        } BIT;
    } DMAMD;
    char           wk2[2];
    unsigned long  DMOFR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DTE:1;
            unsigned char :7;
        } BIT;
    } DMCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SWREQ:1;
            unsigned char :3;
            unsigned char CLRS:1;
            unsigned char :3;
        } BIT;
    } DMREQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ESIF:1;
            unsigned char :3;
            unsigned char DTIF:1;
            unsigned char :2;
            unsigned char ACT:1;
        } BIT;
    } DMSTS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DISEL:1;
            unsigned char :7;
        } BIT;
    } DMCSL;
};

struct st_dmac1
{
    unsigned long  DMSAR;
    unsigned long  DMDAR;
    unsigned long  DMCRA;
    unsigned short DMCRB;
    char           wk0[2];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short DCTG:2;
            unsigned short :6;
            unsigned short SZ:2;
            unsigned short :2;
            unsigned short DTS:2;
            unsigned short MD:2;
        } BIT;
    } DMTMD;
    char           wk1[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DARIE:1;
            unsigned char SARIE:1;
            unsigned char RPTIE:1;
            unsigned char ESIE:1;
            unsigned char DTIE:1;
            unsigned char :3;
        } BIT;
    } DMINT;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short DARA:5;
            unsigned short :1;
            unsigned short DM:2;
            unsigned short SARA:5;
            unsigned short :1;
            unsigned short SM:2;
        } BIT;
    } DMAMD;
    char           wk2[6];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DTE:1;
            unsigned char :7;
        } BIT;
    } DMCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SWREQ:1;
            unsigned char :3;
            unsigned char CLRS:1;
            unsigned char :3;
        } BIT;
    } DMREQ;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ESIF:1;
            unsigned char :3;
            unsigned char DTIF:1;
            unsigned char :2;
            unsigned char ACT:1;
        } BIT;
    } DMSTS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DISEL:1;
            unsigned char :7;
        } BIT;
    } DMCSL;
};

struct st_doc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char OMS:2;
            unsigned char DCSEL:1;
            unsigned char :1;
            unsigned char DOPCIE:1;
            unsigned char DOPCF:1;
            unsigned char DOPCFCL:1;
            unsigned char :1;
        } BIT;
    } DOCR;
    char           wk0[1];
    unsigned short DODIR;
    unsigned short DODSR;
};

struct st_dtc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char RRS:1;
            unsigned char :3;
        } BIT;
    } DTCCR;
    char           wk0[3];
    unsigned long  DTCVBR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SHORT:1;
            unsigned char :7;
        } BIT;
    } DTCADMOD;
    char           wk1[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DTCST:1;
            unsigned char :7;
        } BIT;
    } DTCST;
    char           wk2[1];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short VECN:8;
            unsigned short :7;
            unsigned short ACT:1;
        } BIT;
    } DTCSTS;
};

