AndEmi81/indesit_inertia_rx210/HAL/RN_RX200/RN_RX200_reg.h
struct st_iwdt
{
    unsigned char  IWDTRR;
    char           wk0[1];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short TOPS:2;
            unsigned short :2;
            unsigned short CKS:4;
            unsigned short RPES:2;
            unsigned short :2;
            unsigned short RPSS:2;
            unsigned short :2;
        } BIT;
    } IWDTCR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CNTVAL:14;
            unsigned short UNDFF:1;
            unsigned short REFEF:1;
        } BIT;
    } IWDTSR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char RSTIRQS:1;
        } BIT;
    } IWDTRCR;
    char           wk1[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char SLCSTP:1;
        } BIT;
    } IWDTCSTPR;
};

struct st_mpc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CS0E:1;
            unsigned char CS1E:1;
            unsigned char CS2E:1;
            unsigned char CS3E:1;
            unsigned char CS4E:1;
            unsigned char CS5E:1;
            unsigned char CS6E:1;
            unsigned char CS7E:1;
        } BIT;
    } PFCSE;
    char           wk0[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char A8E:1;
            unsigned char A9E:1;
            unsigned char A10E:1;
            unsigned char A11E:1;
            unsigned char A12E:1;
            unsigned char A13E:1;
            unsigned char A14E:1;
            unsigned char A15E:1;
        } BIT;
    } PFAOE0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char A16E:1;
            unsigned char A17E:1;
            unsigned char A18E:1;
            unsigned char A19E:1;
            unsigned char A20E:1;
            unsigned char A21E:1;
            unsigned char A22E:1;
            unsigned char A23E:1;
        } BIT;
    } PFAOE1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ADRLE:1;
            unsigned char :3;
            unsigned char DHE:1;
            unsigned char :1;
            unsigned char WR1BC1E:1;
            unsigned char :1;
        } BIT;
    } PFBCR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char WAITS:2;
            unsigned char ALEOE:1;
            unsigned char :5;
        } BIT;
    } PFBCR1;
    char           wk1[23];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char PFSWE:1;
            unsigned char B0WI:1;
        } BIT;
    } PWPR;
    char           wk2[35];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL:1;
        } BIT;
    } P03PFS;
    char           wk3[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ASEL:1;
        } BIT;
    } P05PFS;
    char           wk4[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P07PFS;
    char           wk5[2];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P12PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P13PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P14PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P15PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P16PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P17PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P20PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P21PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P22PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P23PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P24PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P25PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P26PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P27PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P30PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P31PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P32PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P33PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } P34PFS;
    char           wk6[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char ASEL:1;
        } BIT;
    } P40PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char ASEL:1;
        } BIT;
    } P41PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char ASEL:1;
        } BIT;
    } P42PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char ASEL:1;
        } BIT;
    } P43PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char ASEL:1;
        } BIT;
    } P44PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char ASEL:1;
        } BIT;
    } P45PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char ASEL:1;
        } BIT;
    } P46PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char ASEL:1;
        } BIT;
    } P47PFS;
    char           wk7[4];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P54PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } P55PFS;
    char           wk8[34];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PA0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :3;
            unsigned char ASEL:1;
        } BIT;
    } PA1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PA2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char ASEL:1;
        } BIT;
    } PA3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char ASEL:1;
        } BIT;
    } PA4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PA5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PA6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PA7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PB0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PB1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PB2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PB3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PB4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PB5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PB6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PB7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PC0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PC1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PC2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PC3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PC4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PC5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PC6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PC7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PD0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PD1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PD2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PD3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PD4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PD5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PD6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PD7PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :3;
            unsigned char ASEL:1;
        } BIT;
    } PE0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :3;
            unsigned char ASEL:1;
        } BIT;
    } PE1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char ASEL:1;
        } BIT;
    } PE2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :3;
            unsigned char ASEL:1;
        } BIT;
    } PE3PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :3;
            unsigned char ASEL:1;
        } BIT;
    } PE4PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char ASEL:1;
        } BIT;
    } PE5PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char ASEL:1;
        } BIT;
    } PE6PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char ASEL:1;
        } BIT;
    } PE7PFS;
    char           wk9[16];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PH0PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PH1PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :2;
            unsigned char ISEL:1;
            unsigned char :1;
        } BIT;
    } PH2PFS;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PH3PFS;
    char           wk10[5];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PJ1PFS;
    char           wk11[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PSEL:4;
            unsigned char :4;
        } BIT;
    } PJ3PFS;
};

