AndEmi81/indesit_inertia_rx210/HAL/RN_RX200/RN_RX200_reg.h
struct st_mtu5
{
    char           wk0[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char NFAEN:1;
            unsigned char NFBEN:1;
            unsigned char NFCEN:1;
            unsigned char NFDEN:1;
            unsigned char NFCS:2;
            unsigned char :2;
        } BIT;
    } NFCR;
    char           wk1[490];
    unsigned short TCNTU;
    unsigned short TGRU;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TPSC:2;
            unsigned char :6;
        } BIT;
    } TCRU;
    char           wk2[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOC:5;
            unsigned char :3;
        } BIT;
    } TIORU;
    char           wk3[9];
    unsigned short TCNTV;
    unsigned short TGRV;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TPSC:2;
            unsigned char :6;
        } BIT;
    } TCRV;
    char           wk4[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOC:5;
            unsigned char :3;
        } BIT;
    } TIORV;
    char           wk5[9];
    unsigned short TCNTW;
    unsigned short TGRW;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TPSC:2;
            unsigned char :6;
        } BIT;
    } TCRW;
    char           wk6[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IOC:5;
            unsigned char :3;
        } BIT;
    } TIORW;
    char           wk7[11];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TGIE5W:1;
            unsigned char TGIE5V:1;
            unsigned char TGIE5U:1;
            unsigned char :5;
        } BIT;
    } TIER;
    char           wk8[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CSTW5:1;
            unsigned char CSTV5:1;
            unsigned char CSTU5:1;
            unsigned char :5;
        } BIT;
    } TSTR;
    char           wk9[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CMPCLR5W:1;
            unsigned char CMPCLR5V:1;
            unsigned char CMPCLR5U:1;
            unsigned char :5;
        } BIT;
    } TCNTCMPCLR;
};

struct st_poe
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned char POE0M:2;
            unsigned char POE1M:2;
            unsigned char POE2M:2;
            unsigned char POE3M:2;
            unsigned char PIE1:1;
            unsigned char :3;
            unsigned char POE0F:1;
            unsigned char POE1F:1;
            unsigned char POE2F:1;
            unsigned char POE3F:1;
        } BIT;
    } ICSR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned char :8;
            unsigned char OIE1:1;
            unsigned char OCE1:1;
            unsigned char :5;
            unsigned char OSF1:1;
        } BIT;
    } OCSR1;
    char           wk0[4];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned char POE8M:2;
            unsigned char :6;
            unsigned char PIE2:1;
            unsigned char POE8E:1;
            unsigned char :2;
            unsigned char POE8F:1;
            unsigned char :3;
        } BIT;
    } ICSR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CH34HIZ:1;
            unsigned char CH0HIZ:1;
            unsigned char :6;
        } BIT;
    } SPOER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PE0ZE:1;
            unsigned char PE1ZE:1;
            unsigned char PE2ZE:1;
            unsigned char PE3ZE:1;
            unsigned char :4;
        } BIT;
    } POECR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char P3CZEA:1;
            unsigned char P2CZEA:1;
            unsigned char P1CZEA:1;
            unsigned char :1;
        } BIT;
    } POECR2;
    char           wk1[1];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned char H;
            unsigned char L;
        } BYTE;
        struct
        {
            unsigned char :8;
            unsigned char :1;
            unsigned char OSTSTE:1;
            unsigned char :2;
            unsigned char OSTSTF:1;
            unsigned char :3;
        } BIT;
    } ICSR3;
};

struct st_port0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B0:1;
            unsigned char B1:1;
            unsigned char B2:1;
            unsigned char B3:1;
            unsigned char B4:1;
            unsigned char B5:1;
            unsigned char B6:1;
            unsigned char B7:1;
        } BIT;
    } PDR;
    char           wk0[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B0:1;
            unsigned char B1:1;
            unsigned char B2:1;
            unsigned char B3:1;
            unsigned char B4:1;
            unsigned char B5:1;
            unsigned char B6:1;
            unsigned char B7:1;
        } BIT;
    } PODR;
    char           wk1[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char B3:1;
            unsigned char :1;
            unsigned char B5:1;
            unsigned char :1;
            unsigned char B7:1;
        } BIT;
    } PIDR;
    char           wk2[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char B3:1;
            unsigned char :1;
            unsigned char B5:1;
            unsigned char :1;
            unsigned char B7:1;
        } BIT;
    } PMR;
    char           wk3[95];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char B3:1;
            unsigned char :1;
            unsigned char B5:1;
            unsigned char :1;
            unsigned char B7:1;
        } BIT;
    } PCR;
};

struct st_port1
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B0:1;
            unsigned char B1:1;
            unsigned char B2:1;
            unsigned char B3:1;
            unsigned char B4:1;
            unsigned char B5:1;
            unsigned char B6:1;
            unsigned char B7:1;
        } BIT;
    } PDR;
    char           wk0[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B0:1;
            unsigned char B1:1;
            unsigned char B2:1;
            unsigned char B3:1;
            unsigned char B4:1;
            unsigned char B5:1;
            unsigned char B6:1;
            unsigned char B7:1;
        } BIT;
    } PODR;
    char           wk1[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char B2:1;
            unsigned char B3:1;
            unsigned char B4:1;
            unsigned char B5:1;
            unsigned char B6:1;
            unsigned char B7:1;
        } BIT;
    } PIDR;
    char           wk2[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char B2:1;
            unsigned char B3:1;
            unsigned char B4:1;
            unsigned char B5:1;
            unsigned char B6:1;
            unsigned char B7:1;
        } BIT;
    } PMR;
    char           wk3[32];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char B4:1;
            unsigned char :1;
            unsigned char B6:1;
            unsigned char :1;
        } BIT;
    } ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B0:1;
            unsigned char :1;
            unsigned char B2:1;
            unsigned char :1;
            unsigned char B4:1;
            unsigned char :1;
            unsigned char B6:1;
            unsigned char :1;
        } BIT;
    } ODR1;
    char           wk4[61];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char B2:1;
            unsigned char B3:1;
            unsigned char B4:1;
            unsigned char B5:1;
            unsigned char B6:1;
            unsigned char B7:1;
        } BIT;
    } PCR;
    char           wk5[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char B2:1;
            unsigned char B3:1;
            unsigned char B4:1;
            unsigned char B5:1;
            unsigned char B6:1;
            unsigned char B7:1;
        } BIT;
    } DSCR;
};

