AndEmi81/indesit_inertia_rx210/HAL/RN_RX200/RN_RX200_reg.h
struct st_elc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELCON:1;
        } BIT;
    } ELCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ELS:8;
        } BIT;
    } ELSR[30];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char MTU3MD:2;
            unsigned char MTU2MD:2;
            unsigned char MTU1MD:2;
        } BIT;
    } ELOPA;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :6;
            unsigned char MTU4MD:2;
        } BIT;
    } ELOPB;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char CMT1MD:2;
        } BIT;
    } ELOPC;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char TMR2MD:2;
            unsigned char :2;
            unsigned char TMR0MD:2;
        } BIT;
    } ELOPD;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PRG7:1;
            unsigned char PRG6:1;
            unsigned char PRG5:1;
            unsigned char PRG4:1;
            unsigned char PRG3:1;
            unsigned char PRG2:1;
            unsigned char PRG1:1;
            unsigned char PRG0:1;
        } BIT;
    } PGR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PRG7:1;
            unsigned char PRG6:1;
            unsigned char PRG5:1;
            unsigned char PRG4:1;
            unsigned char PRG3:1;
            unsigned char PRG2:1;
            unsigned char PRG1:1;
            unsigned char PRG0:1;
        } BIT;
    } PGR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PGCO:3;
            unsigned char :1;
            unsigned char PGCOVE:1;
            unsigned char PGCI:2;
        } BIT;
    } PGC1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PGCO:3;
            unsigned char :1;
            unsigned char PGCOVE:1;
            unsigned char PGCI:2;
        } BIT;
    } PGC2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PDBF7:1;
            unsigned char PDBF6:1;
            unsigned char PDBF5:1;
            unsigned char PDBF4:1;
            unsigned char PDBF3:1;
            unsigned char PDBF2:1;
            unsigned char PDBF1:1;
            unsigned char PDBF0:1;
        } BIT;
    } PDBF1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PDBF7:1;
            unsigned char PDBF6:1;
            unsigned char PDBF5:1;
            unsigned char PDBF4:1;
            unsigned char PDBF3:1;
            unsigned char PDBF2:1;
            unsigned char PDBF1:1;
            unsigned char PDBF0:1;
        } BIT;
    } PDBF2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PSM:2;
            unsigned char PSP:2;
            unsigned char PSB:3;
        } BIT;
    } PEL0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PSM:2;
            unsigned char PSP:2;
            unsigned char PSB:3;
        } BIT;
    } PEL1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PSM:2;
            unsigned char PSP:2;
            unsigned char PSB:3;
        } BIT;
    } PEL2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PSM:2;
            unsigned char PSP:2;
            unsigned char PSB:3;
        } BIT;
    } PEL3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char WI:1;
            unsigned char WE:1;
            unsigned char :5;
            unsigned char SEG:1;
        } BIT;
    } ELSEGR;
};

struct st_exsystem
{
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long :29;
            unsigned long MDE:3;
        } BIT;
    } MDEB;
    char           wk0[8388484];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long :29;
            unsigned long MDE:3;
        } BIT;
    } MDES;
    char           wk1[4];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long :23;
            unsigned long HOCOEN:1;
            unsigned long :5;
            unsigned long LVDAS:1;
            unsigned long VDSEL:2;
        } BIT;
    } OFS1;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long :3;
            unsigned long WDTRSTIRQS:1;
            unsigned long WDTRPSS:2;
            unsigned long WDTRPES:2;
            unsigned long WDTCKS:4;
            unsigned long WDTTOPS:2;
            unsigned long WDTSTRT:1;
            unsigned long :2;
            unsigned long IWDTSLCSTP:1;
            unsigned long :1;
            unsigned long IWDTRSTIRQS:1;
            unsigned long IWDTRPSS:2;
            unsigned long IWDTRPES:2;
            unsigned long IWDTCKS:4;
            unsigned long IWDTTOPS:2;
            unsigned long IWDTSTRT:1;
        } BIT;
    } OFS0;
};

struct st_flash
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :6;
            unsigned char FLWE:2;
        } BIT;
    } FWEPROR;
    char           wk0[7799147];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char FRDMD:1;
        } BIT;
    } FMODR;
    char           wk1[13];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ROMAE:1;
            unsigned char :2;
            unsigned char CMDLK:1;
            unsigned char DFLAE:1;
            unsigned char :1;
            unsigned char DFLRPE:1;
            unsigned char DFLWPE:1;
        } BIT;
    } FASTAT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ROMAEIE:1;
            unsigned char :2;
            unsigned char CMDLKIE:1;
            unsigned char DFLAEIE:1;
            unsigned char :1;
            unsigned char DFLRPEIE:1;
            unsigned char DFLWPEIE:1;
        } BIT;
    } FAEINT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char FRDYIE:1;
        } BIT;
    } FRDYIE;
    char           wk2[45];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY:8;
            unsigned short :4;
            unsigned short DBRE03:1;
            unsigned short DBRE02:1;
            unsigned short DBRE01:1;
            unsigned short DBRE00:1;
        } BIT;
    } DFLRE0;
    char           wk3[14];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY:8;
            unsigned short :4;
            unsigned short DBWE03:1;
            unsigned short DBWE02:1;
            unsigned short DBWE01:1;
            unsigned short DBWE00:1;
        } BIT;
    } DFLWE0;
    char           wk4[2];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY:8;
            unsigned short :7;
            unsigned short FCRME:1;
        } BIT;
    } FCURAME;
    char           wk5[15194];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char FRDY:1;
            unsigned char ILGLERR:1;
            unsigned char ERSERR:1;
            unsigned char PRGERR:1;
            unsigned char SUSRDY:1;
            unsigned char :1;
            unsigned char ERSSPD:1;
            unsigned char PRGSPD:1;
        } BIT;
    } FSTATR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char FCUERR:1;
            unsigned char :2;
            unsigned char FLOCKST:1;
        } BIT;
    } FSTATR1;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short FEKEY:8;
            unsigned short FENTRYD:1;
            unsigned short :6;
            unsigned short FENTRY0:1;
        } BIT;
    } FENTRYR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short FPKEY:8;
            unsigned short :7;
            unsigned short FPROTCN:1;
        } BIT;
    } FPROTR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short FRKEY:8;
            unsigned short :7;
            unsigned short FRESET:1;
        } BIT;
    } FRESETR;
    char           wk6[2];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short CMDR:8;
            unsigned short PCMDR:8;
        } BIT;
    } FCMDR;
    char           wk7[12];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :15;
            unsigned short ESUSPMD:1;
        } BIT;
    } FCPSR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short BCSIZE:1;
            unsigned short BCMODE:2;
            unsigned short :2;
            unsigned short BCADR:11;
        } BIT;
    } DFLBCCNT;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :8;
            unsigned short PEERRST:8;
        } BIT;
    } FPESTAT;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :15;
            unsigned short BCST:1;
        } BIT;
    } DFLBCSTAT;
    char           wk8[24];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :8;
            unsigned short PCKA:8;
        } BIT;
    } PCKAR;
};

struct st_icu
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char IR:1;
        } BIT;
    } IR[250];
    char           wk0[6];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char DTCE:1;
        } BIT;
    } DTCER[249];
    char           wk1[7];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char IEN7:1;
            unsigned char IEN6:1;
            unsigned char IEN5:1;
            unsigned char IEN4:1;
            unsigned char IEN3:1;
            unsigned char IEN2:1;
            unsigned char IEN1:1;
            unsigned char IEN0:1;
        } BIT;
    } IER[32];
    char           wk2[192];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char SWINT:1;
        } BIT;
    } SWINTR;
    char           wk3[15];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short FIEN:1;
            unsigned short :7;
            unsigned short FVCT:8;
        } BIT;
    } FIR;
    char           wk4[14];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char IPR:4;
        } BIT;
    } IPR[250];
    char           wk5[6];
    unsigned char  DMRSR0;
    char           wk6[3];
    unsigned char  DMRSR1;
    char           wk7[3];
    unsigned char  DMRSR2;
    char           wk8[3];
    unsigned char  DMRSR3;
    char           wk9[243];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char IRQMD:2;
        } BIT;
    } IRQCR[8];
    char           wk10[8];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char FLTEN7:1;
            unsigned char FLTEN6:1;
            unsigned char FLTEN5:1;
            unsigned char FLTEN4:1;
            unsigned char FLTEN3:1;
            unsigned char FLTEN2:1;
            unsigned char FLTEN1:1;
            unsigned char FLTEN0:1;
        } BIT;
    } IRQFLTE0;
    char           wk11[3];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short FCLKSEL7:2;
            unsigned short FCLKSEL6:2;
            unsigned short FCLKSEL5:2;
            unsigned short FCLKSEL4:2;
            unsigned short FCLKSEL3:2;
            unsigned short FCLKSEL2:2;
            unsigned short FCLKSEL1:2;
            unsigned short FCLKSEL0:2;
        } BIT;
    } IRQFLTC0;
    char           wk12[106];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char LVD2ST:1;
            unsigned char LVD1ST:1;
            unsigned char IWDTST:1;
            unsigned char WDTST:1;
            unsigned char OSTST:1;
            unsigned char NMIST:1;
        } BIT;
    } NMISR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char LVD2EN:1;
            unsigned char LVD1EN:1;
            unsigned char IWDTEN:1;
            unsigned char WDTEN:1;
            unsigned char OSTEN:1;
            unsigned char NMIEN:1;
        } BIT;
    } NMIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char LVD2CLR:1;
            unsigned char LVD1CLR:1;
            unsigned char IWDTCLR:1;
            unsigned char WDTCLR:1;
            unsigned char OSTCLR:1;
            unsigned char NMICLR:1;
        } BIT;
    } NMICLR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char NMIMD:1;
        } BIT;
    } NMICR;
    char           wk13[12];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char NFLTEN:1;
        } BIT;
    } NMIFLTE;
    char           wk14[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :6;
            unsigned char NFCLKSEL:2;
        } BIT;
    } NMIFLTC;
};

