AndEmi81/indesit_inertia_rx210/HAL/RN_RX200/RN_RX200_reg.h
struct st_portb
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PDR;
    char           wk0[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PODR;
    char           wk1[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PIDR;
    char           wk2[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PMR;
    char           wk3[42];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char :1;
            unsigned char B4:1;
            unsigned char :1;
            unsigned char B2:1;
            unsigned char :1;
            unsigned char B0:1;
        } BIT;
    } ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char :1;
            unsigned char B4:1;
            unsigned char :1;
            unsigned char B2:1;
            unsigned char :1;
            unsigned char B0:1;
        } BIT;
    } ODR1;
    char           wk4[51];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PCR;
    char           wk5[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DSCR;
};

struct st_portc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PDR;
    char           wk0[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PODR;
    char           wk1[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PIDR;
    char           wk2[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PMR;
    char           wk3[43];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char :1;
            unsigned char B4:1;
            unsigned char :1;
            unsigned char B2:1;
            unsigned char :1;
            unsigned char B0:1;
        } BIT;
    } ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char :1;
            unsigned char B4:1;
            unsigned char :1;
            unsigned char B2:1;
            unsigned char :1;
            unsigned char B0:1;
        } BIT;
    } ODR1;
    char           wk4[50];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PCR;
    char           wk5[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DSCR;
};

struct st_portd
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PDR;
    char           wk0[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PODR;
    char           wk1[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PIDR;
    char           wk2[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PMR;
    char           wk3[95];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PCR;
    char           wk4[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DSCR;
};

struct st_porte
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PDR;
    char           wk0[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PODR;
    char           wk1[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PIDR;
    char           wk2[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PMR;
    char           wk3[45];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char :1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char :1;
            unsigned char B0:1;
        } BIT;
    } ODR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char B6:1;
            unsigned char :1;
            unsigned char B4:1;
            unsigned char :1;
            unsigned char B2:1;
            unsigned char :1;
            unsigned char B0:1;
        } BIT;
    } ODR1;
    char           wk4[48];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PCR;
    char           wk5[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DSCR;
};

struct st_porth
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PDR;
    char           wk0[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PODR;
    char           wk1[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PIDR;
    char           wk2[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PMR;
    char           wk3[95];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PCR;
    char           wk4[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } DSCR;
};

struct st_portj
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PDR;
    char           wk0[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char B7:1;
            unsigned char B6:1;
            unsigned char B5:1;
            unsigned char B4:1;
            unsigned char B3:1;
            unsigned char B2:1;
            unsigned char B1:1;
            unsigned char B0:1;
        } BIT;
    } PODR;
    char           wk1[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char B3:1;
            unsigned char :1;
            unsigned char B1:1;
        } BIT;
    } PIDR;
    char           wk2[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char B3:1;
            unsigned char :1;
            unsigned char B1:1;
        } BIT;
    } PMR;
    char           wk3[95];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char B3:1;
            unsigned char :1;
            unsigned char B1:1;
        } BIT;
    } PCR;
    char           wk4[31];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char B3:1;
            unsigned char :1;
            unsigned char B1:1;
        } BIT;
    } DSCR;
};

struct st_riic
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ICE:1;
            unsigned char IICRST:1;
            unsigned char CLO:1;
            unsigned char SOWP:1;
            unsigned char SCLO:1;
            unsigned char SDAO:1;
            unsigned char SCLI:1;
            unsigned char SDAI:1;
        } BIT;
    } ICCR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char BBSY:1;
            unsigned char MST:1;
            unsigned char TRS:1;
            unsigned char RSPA:1;
            unsigned char SP:1;
            unsigned char RS:1;
            unsigned char ST:1;
        } BIT;
    } ICCR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char MTWP:1;
            unsigned char CKS:3;
            unsigned char BCWP:1;
            unsigned char BC:3;
        } BIT;
    } ICMR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DLCS:1;
            unsigned char SDDL:3;
            unsigned char :1;
            unsigned char TMOH:1;
            unsigned char TMOL:1;
            unsigned char TMOS:1;
        } BIT;
    } ICMR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SMBS:1;
            unsigned char WAIT:1;
            unsigned char RDRFS:1;
            unsigned char ACKWP:1;
            unsigned char ACKBT:1;
            unsigned char ACKBR:1;
            unsigned char NF:2;
        } BIT;
    } ICMR3;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char SCLE:1;
            unsigned char NFE:1;
            unsigned char NACKE:1;
            unsigned char SALE:1;
            unsigned char NALE:1;
            unsigned char MALE:1;
            unsigned char TMOE:1;
        } BIT;
    } ICFER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char HOAE:1;
            unsigned char :1;
            unsigned char DIDE:1;
            unsigned char :1;
            unsigned char GCAE:1;
            unsigned char SAR2E:1;
            unsigned char SAR1E:1;
            unsigned char SAR0E:1;
        } BIT;
    } ICSER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TIE:1;
            unsigned char TEIE:1;
            unsigned char RIE:1;
            unsigned char NAKIE:1;
            unsigned char SPIE:1;
            unsigned char STIE:1;
            unsigned char ALIE:1;
            unsigned char TMOIE:1;
        } BIT;
    } ICIER;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char HOA:1;
            unsigned char :1;
            unsigned char DID:1;
            unsigned char :1;
            unsigned char GCA:1;
            unsigned char AAS2:1;
            unsigned char AAS1:1;
            unsigned char AAS0:1;
        } BIT;
    } ICSR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TDRE:1;
            unsigned char TEND:1;
            unsigned char RDRF:1;
            unsigned char NACKF:1;
            unsigned char STOP:1;
            unsigned char START:1;
            unsigned char AL:1;
            unsigned char TMOF:1;
        } BIT;
    } ICSR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SVA:7;
            unsigned char SVA0:1;
        } BIT;
    } SARL0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char SVA:2;
            unsigned char FS:1;
        } BIT;
    } SARU0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SVA:7;
            unsigned char SVA0:1;
        } BIT;
    } SARL1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char SVA:2;
            unsigned char FS:1;
        } BIT;
    } SARU1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char SVA:7;
            unsigned char SVA0:1;
        } BIT;
    } SARL2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char SVA:2;
            unsigned char FS:1;
        } BIT;
    } SARU2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char BRL:5;
        } BIT;
    } ICBRL;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char BRH:5;
        } BIT;
    } ICBRH;
    unsigned char  ICDRT;
    unsigned char  ICDRR;
};

