AndEmi81/indesit_inertia_rx210/HAL/RN_RX200/RN_RX200_reg.h
struct st_rtc
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char F1HZ:1;
            unsigned char F2HZ:1;
            unsigned char F4HZ:1;
            unsigned char F8HZ:1;
            unsigned char F16HZ:1;
            unsigned char F32HZ:1;
            unsigned char F64HZ:1;
        } BIT;
    } R64CNT;
    char           wk0[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char SEC10:3;
            unsigned char SEC1:4;
        } BIT;
    } RSECCNT;
    char           wk1[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char MIN10:3;
            unsigned char MIN1:4;
        } BIT;
    } RMINCNT;
    char           wk2[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PM:1;
            unsigned char HR10:2;
            unsigned char HR1:4;
        } BIT;
    } RHRCNT;
    char           wk3[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char DAYW:3;
        } BIT;
    } RWKCNT;
    char           wk4[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :2;
            unsigned char DATE10:2;
            unsigned char DATE1:4;
        } BIT;
    } RDAYCNT;
    char           wk5[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char MON10:1;
            unsigned char MON1:4;
        } BIT;
    } RMONCNT;
    char           wk6[1];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :8;
            unsigned short YR10:4;
            unsigned short YR1:4;
        } BIT;
    } RYRCNT;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB:1;
            unsigned char SEC10:3;
            unsigned char SEC1:4;
        } BIT;
    } RSECAR;
    char           wk7[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB:1;
            unsigned char MIN10:3;
            unsigned char MIN1:4;
        } BIT;
    } RMINAR;
    char           wk8[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB:1;
            unsigned char PM:1;
            unsigned char HR10:2;
            unsigned char HR1:4;
        } BIT;
    } RHRAR;
    char           wk9[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB:1;
            unsigned char :4;
            unsigned char DAYW:3;
        } BIT;
    } RWKAR;
    char           wk10[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB:1;
            unsigned char :1;
            unsigned char DATE10:2;
            unsigned char DATE1:4;
        } BIT;
    } RDAYAR;
    char           wk11[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB:1;
            unsigned char :2;
            unsigned char MON10:1;
            unsigned char MON1:4;
        } BIT;
    } RMONAR;
    char           wk12[1];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :8;
            unsigned short YR10:4;
            unsigned short YR1:4;
        } BIT;
    } RYRAR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char ENB:1;
        } BIT;
    } RYRAREN;
    char           wk13[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PES:4;
            unsigned char :1;
            unsigned char PIE:1;
            unsigned char CIE:1;
            unsigned char AIE:1;
        } BIT;
    } RCR1;
    char           wk14[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char HR24:1;
            unsigned char AADJP:1;
            unsigned char AADJE:1;
            unsigned char RTCOE:1;
            unsigned char ADJ30:1;
            unsigned char RESET:1;
            unsigned char START:1;
        } BIT;
    } RCR2;
    char           wk15[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char RTCEN:1;
        } BIT;
    } RCR3;
    char           wk16[7];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char PMADJ:2;
            unsigned char ADJ:6;
        } BIT;
    } RADJ;
    char           wk17[17];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCEN:1;
            unsigned char :1;
            unsigned char TCNF:2;
            unsigned char :1;
            unsigned char TCST:1;
            unsigned char TCCT:2;
        } BIT;
    } RTCCR0;
    char           wk18[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCEN:1;
            unsigned char :1;
            unsigned char TCNF:2;
            unsigned char :1;
            unsigned char TCST:1;
            unsigned char TCCT:2;
        } BIT;
    } RTCCR1;
    char           wk19[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TCEN:1;
            unsigned char :1;
            unsigned char TCNF:2;
            unsigned char :1;
            unsigned char TCST:1;
            unsigned char TCCT:2;
        } BIT;
    } RTCCR2;
    char           wk20[13];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char SEC10:3;
            unsigned char SEC1:4;
        } BIT;
    } RSECCP0;
    char           wk21[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char MIN10:3;
            unsigned char MIN1:4;
        } BIT;
    } RMINCP0;
    char           wk22[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PM:1;
            unsigned char HR10:2;
            unsigned char HR1:4;
        } BIT;
    } RHRCP0;
    char           wk23[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char DATE10:3;
            unsigned char DATE1:4;
        } BIT;
    } RDAYCP0;
    char           wk24[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char MON10:1;
            unsigned char MON1:4;
        } BIT;
    } RMONCP0;
    char           wk25[5];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char SEC10:3;
            unsigned char SEC1:4;
        } BIT;
    } RSECCP1;
    char           wk26[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char MIN10:3;
            unsigned char MIN1:4;
        } BIT;
    } RMINCP1;
    char           wk27[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PM:1;
            unsigned char HR10:2;
            unsigned char HR1:4;
        } BIT;
    } RHRCP1;
    char           wk28[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char DATE10:3;
            unsigned char DATE1:4;
        } BIT;
    } RDAYCP1;
    char           wk29[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char MON10:1;
            unsigned char MON1:4;
        } BIT;
    } RMONCP1;
    char           wk30[5];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char SEC10:3;
            unsigned char SEC1:4;
        } BIT;
    } RSECCP2;
    char           wk31[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char MIN10:3;
            unsigned char MIN1:4;
        } BIT;
    } RMINCP2;
    char           wk32[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char PM:1;
            unsigned char HR10:2;
            unsigned char HR1:4;
        } BIT;
    } RHRCP2;
    char           wk33[3];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char DATE10:3;
            unsigned char DATE1:4;
        } BIT;
    } RDAYCP2;
    char           wk34[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char MON10:1;
            unsigned char MON1:4;
        } BIT;
    } RMONCP2;
};

