AndEmi81/indesit_inertia_rx210/HAL/RN_RX200/RN_RX200_reg.h
struct st_system
{
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :15;
            unsigned short MD:1;
        } BIT;
    } MDMONR;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :10;
            unsigned short UBTS:1;
            unsigned short BOTS:1;
            unsigned short :2;
            unsigned short EXB:1;
            unsigned short IROM:1;
        } BIT;
    } MDSR;
    char           wk0[2];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short KEY:8;
            unsigned short :6;
            unsigned short EXBE:1;
            unsigned short ROME:1;
        } BIT;
    } SYSCR0;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :15;
            unsigned short RAME:1;
        } BIT;
    } SYSCR1;
    char           wk1[2];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short SSBY:1;
            unsigned short OPE:1;
        } BIT;
    } SBYCR;
    char           wk2[2];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long ACSE:1;
            unsigned long :1;
            unsigned long MSTPA29:1;
            unsigned long MSTPA28:1;
            unsigned long MSTPA27:1;
            unsigned long :2;
            unsigned long MSTPA24:1;
            unsigned long :4;
            unsigned long MSTPA19:1;
            unsigned long :1;
            unsigned long MSTPA17:1;
            unsigned long :1;
            unsigned long MSTPA15:1;
            unsigned long MSTPA14:1;
            unsigned long :4;
            unsigned long MSTPA9:1;
            unsigned long :3;
            unsigned long MSTPA5:1;
            unsigned long MSTPA4:1;
        } BIT;
    } MSTPCRA;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long MSTPB31:1;
            unsigned long MSTPB30:1;
            unsigned long :3;
            unsigned long MSTPB26:1;
            unsigned long MSTPB25:1;
            unsigned long :1;
            unsigned long MSTPB23:1;
            unsigned long :1;
            unsigned long MSTPB21:1;
            unsigned long :3;
            unsigned long MSTPB17:1;
            unsigned long :6;
            unsigned long MSTPB10:1;
            unsigned long MSTPB9:1;
            unsigned long MSTPB8:1;
            unsigned long :1;
            unsigned long MSTPB6:1;
            unsigned long :1;
            unsigned long MSTPB4:1;
        } BIT;
    } MSTPCRB;
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long :4;
            unsigned long MSTPC27:1;
            unsigned long MSTPC26:1;
            unsigned long :6;
            unsigned long MSTPC19:1;
            unsigned long :18;
            unsigned long MSTPC0:1;
        } BIT;
    } MSTPCRC;
    char           wk3[4];
    union
    {
        unsigned long LONG;
        struct
        {
            unsigned long FCK:4;
            unsigned long ICK:4;
            unsigned long PSTOP1:1;
            unsigned long :3;
            unsigned long BCK:4;
            unsigned long :4;
            unsigned long PCKB:4;
            unsigned long :4;
            unsigned long PCKD:4;
        } BIT;
    } SCKCR;
    char           wk4[2];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :5;
            unsigned short CKSEL:3;
        } BIT;
    } SCKCR3;
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short :3;
            unsigned short STC:5;
            unsigned short :6;
            unsigned short PLIDIV:2;
        } BIT;
    } PLLCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char PLLEN:1;
        } BIT;
    } PLLCR2;
    char           wk5[5];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char BCLKDIV:1;
        } BIT;
    } BCKCR;
    char           wk6[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char MOSTP:1;
        } BIT;
    } MOSCCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char SOSTP:1;
        } BIT;
    } SOSCCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char LCSTP:1;
        } BIT;
    } LOCOCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char ILCSTP:1;
        } BIT;
    } ILOCOCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char HCSTP:1;
        } BIT;
    } HOCOCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :6;
            unsigned char HCFRQ:2;
        } BIT;
    } HOCOCR2;
    char           wk7[8];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char OSTDE:1;
            unsigned char :6;
            unsigned char OSTDIE:1;
        } BIT;
    } OSTDCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char OSTDF:1;
        } BIT;
    } OSTDSR;
    char           wk8[94];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char OPCMTSF:1;
            unsigned char :1;
            unsigned char OPCM:3;
        } BIT;
    } OPCCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char RSTCKEN:1;
            unsigned char :4;
            unsigned char RSTCKSEL:3;
        } BIT;
    } RSTCKCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char MSTS:5;
        } BIT;
    } MOSCWTCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char SSTS:5;
        } BIT;
    } SOSCWTCR;
    char           wk9[2];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :3;
            unsigned char PSTS:5;
        } BIT;
    } PLLWTCR;
    char           wk10[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char LSTS2:4;
        } BIT;
    } LOCOWTCR2;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char HSTS2:4;
        } BIT;
    } HOCOWTCR2;
    char           wk11[22];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char SWRF:1;
            unsigned char WDTRF:1;
            unsigned char IWDTRF:1;
        } BIT;
    } RSTSR2;
    char           wk12[1];
    unsigned short SWRR;
    char           wk13[28];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char LVD1IRQSEL:1;
            unsigned char LVD1IDTSEL:2;
        } BIT;
    } LVD1CR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :6;
            unsigned char LVD1MON:1;
            unsigned char LVD1DET:1;
        } BIT;
    } LVD1SR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char LVD2IRQSEL:1;
            unsigned char LVD2IDTSEL:2;
        } BIT;
    } LVD2CR1;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :6;
            unsigned char LVD2MON:1;
            unsigned char LVD2DET:1;
        } BIT;
    } LVD2SR;
    char           wk14[794];
    union
    {
        unsigned short WORD;
        struct
        {
            unsigned short PRKEY:8;
            unsigned short :4;
            unsigned short PRC3:1;
            unsigned short :1;
            unsigned short PRC1:1;
            unsigned short PRC0:1;
        } BIT;
    } PRCR;
    char           wk15[48768];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DPSBY:1;
            unsigned char IOKEEP:1;
            unsigned char :4;
            unsigned char DEEPCUT1:1;
        } BIT;
    } DPSBYCR;
    char           wk16[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DIRQ7E:1;
            unsigned char DIRQ6E:1;
            unsigned char DIRQ5E:1;
            unsigned char DIRQ4E:1;
            unsigned char DIRQ3E:1;
            unsigned char DIRQ2E:1;
            unsigned char DIRQ1E:1;
            unsigned char DIRQ0E:1;
        } BIT;
    } DPSIER0;
    char           wk17[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char DIICCIE:1;
            unsigned char DIICDIE:1;
            unsigned char DNMIE:1;
            unsigned char DRTCAIE:1;
            unsigned char DRTCIIE:1;
            unsigned char DLVD2IE:1;
            unsigned char DLVD1IE:1;
        } BIT;
    } DPSIER2;
    char           wk18[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DIRQ7F:1;
            unsigned char DIRQ6F:1;
            unsigned char DIRQ5F:1;
            unsigned char DIRQ4F:1;
            unsigned char DIRQ3F:1;
            unsigned char DIRQ2F:1;
            unsigned char DIRQ1F:1;
            unsigned char DIRQ0F:1;
        } BIT;
    } DPSIFR0;
    char           wk19[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char DRIICCIF:1;
            unsigned char DRIICDIF:1;
            unsigned char DNMIF:1;
            unsigned char DRTCAIF:1;
            unsigned char DRTCIIF:1;
            unsigned char DLVD2IF:1;
            unsigned char DLVD1IF:1;
        } BIT;
    } DPSIFR2;
    char           wk20[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DIRQ7EG:1;
            unsigned char DIRQ6EG:1;
            unsigned char DIRQ5EG:1;
            unsigned char DIRQ4EG:1;
            unsigned char DIRQ3EG:1;
            unsigned char DIRQ2EG:1;
            unsigned char DIRQ1EG:1;
            unsigned char DIRQ0EG:1;
        } BIT;
    } DPSIEGR0;
    char           wk21[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char DRIICCEG:1;
            unsigned char DRIICDEG:1;
            unsigned char DNMIEG:1;
            unsigned char :2;
            unsigned char DLVD2EG:1;
            unsigned char DLVD1EG:1;
        } BIT;
    } DPSIEGR2;
    char           wk22[2];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :5;
            unsigned char SOFTCUT:3;
        } BIT;
    } FHSSBYCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char DPSRSTF:1;
            unsigned char :3;
            unsigned char LVD2RF:1;
            unsigned char LVD1RF:1;
            unsigned char LVD0RF:1;
            unsigned char PORF:1;
        } BIT;
    } RSTSR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char CWSF:1;
        } BIT;
    } RSTSR1;
    char           wk23[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char MOSEL:1;
            unsigned char MODRV2:2;
            unsigned char MODRV:3;
            unsigned char MOFXIN:1;
        } BIT;
    } MOFCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char HOCOPCNT:1;
        } BIT;
    } HOCOPCR;
    char           wk24[2];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :1;
            unsigned char LVD2E:1;
            unsigned char LVD1E:1;
            unsigned char :1;
            unsigned char EXVCCINP2:1;
            unsigned char EXVREFINP2:1;
            unsigned char EXVCCINP1:1;
            unsigned char EXVREFINP1:1;
        } BIT;
    } LVCMPCR;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char LVD2LVL:4;
            unsigned char LVD1LVL:4;
        } BIT;
    } LVDLVLR;
    char           wk25[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char LVD1RN:1;
            unsigned char LVD1RI:1;
            unsigned char LVD1FSAMP:2;
            unsigned char :1;
            unsigned char LVD1CMPE:1;
            unsigned char LVD1DFDIS:1;
            unsigned char LVD1RIE:1;
        } BIT;
    } LVD1CR0;
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char LVD2RN:1;
            unsigned char LVD2RI:1;
            unsigned char LVD2FSAMP:2;
            unsigned char :1;
            unsigned char LVD2CMPE:1;
            unsigned char LVD2DFDIS:1;
            unsigned char LVD2RIE:1;
        } BIT;
    } LVD2CR0;
    char           wk26[4];
    unsigned char  DPSBKR[32];
};

struct st_temps
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TSEN:1;
            unsigned char PGAEN:1;
            unsigned char :4;
            unsigned char PGAGAIN:2;
        } BIT;
    } TSCR;
};

struct st_tmr0
{
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char CMIEB:1;
            unsigned char CMIEA:1;
            unsigned char OVIE:1;
            unsigned char CCLR:2;
        } BIT;
    } TCR;
    char           wk0[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :4;
            unsigned char OSB:2;
            unsigned char OSA:2;
        } BIT;
    } TCSR;
    char           wk1[1];
    unsigned char  TCORA;
    char           wk2[1];
    unsigned char  TCORB;
    char           wk3[1];
    unsigned char  TCNT;
    char           wk4[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char TMRIS:1;
            unsigned char :2;
            unsigned char CSS:2;
            unsigned char CKS:3;
        } BIT;
    } TCCR;
    char           wk5[1];
    union
    {
        unsigned char BYTE;
        struct
        {
            unsigned char :7;
            unsigned char TCS:1;
        } BIT;
    } TCSTR;
};

